# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [ ]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [1]:
import pandas as pd
import numpy as np

s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [2]:
housemarket = pd.concat([s1,s2,s3],axis=1)
housemarket

    0  1      2
0   2  2  28675
1   2  3  24106
2   2  3  12749
3   3  3  25443
4   3  3  12752
.. .. ..    ...
95  4  2  26013
96  4  3  26752
97  2  2  16352
98  3  3  16495
99  1  2  29414

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [3]:
housemarket.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
housemarket.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            28675
1      2       3            24106
2      2       3            12749
3      3       3            25443
4      3       3            12752

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [4]:
bigcolumn = pd.concat([s1, s2, s3], axis=0)
bigcolumn = bigcolumn.to_frame()
bigcolumn

        0
0       2
1       2
2       2
3       3
4       3
..    ...
95  26013
96  26752
97  16352
98  16495
99  29414

[300 rows x 1 columns]

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [5]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [6]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        2
1        2
2        2
3        3
4        3
..     ...
295  26013
296  26752
297  16352
298  16495
299  29414

[300 rows x 1 columns]